{"content":[{"type":"h1","text":"Build a great profile"},{"type":"h2","text":"Step-by-Step Guide to Create an Online Freelance Profile That People Will Love."},{"type":"content","text":"You became a freelancer for a reason: to have the luxury to work for yourself and build a business from the ground up. On that same token, as a freelancer, your survival in the gig economy relies heavily on your ability to market yourself—to rise above the others. If not, you run the risk of being overlooked or passed over for yet another chance at work, the experience and the paycheck."},{"type":"content","text":"Reflecting on the number of ways you market yourself, can you trace the last time your online freelance profile was the primary source of winning business? If you’re scratching your head, it may be time to kick it up a notch. Why? Remember: By 2020, it’s expected that 40% of the U.S. workforce will be part of the gig economy, which means the competition will only get fiercer. So your profile can mean the difference between finding lots of new business—or losing every pitch."},{"type":"content","text":"Start bringing a little bit of the saying “content is king” to your freelance profile. To help you create one that will attract new business and make you shine, we’ve created a simple, actionable seven-step process built for any type of freelancer."},{"type":"h2","text":"Step 1: Write a Headline That’s Clear, Concise and Effective"},{"type":"content","text":"Your headline should get straight to the point. We recommend keeping it to one line, so you don’t get bogged down with jargon or superfluity. After all, you’ll have the opportunity to write about yourself with detail and flair in the profile itself. All you need to do is simply include the following three pieces of information:"},{"type":"list","text":"Title\r\n|Years of experience\r\n|Specialty"},{"type":"content","text":"With these three key elements, you’ll be able to communicate your basic qualifications and expertise—which is often enough to help you move past an initial glance from job posters."},{"type":"h2","text":"Step 2: Articulate the Value You’ll Bring"},{"type":"content","text":"Rather than explaining the “what,” focus on the “how.” How were you able to boost your client’s business sales by 110%? How did you transform a client’s cubicle-style office to a dream workplace?"},{"type":"content","text":"People are much more intrigued by your ability to solve problems and drive results, rather than the granular details of what you do."},{"type":"h2","text":"Step 3: Share Your Qualifications and Experience"},{"type":"content","text":"Aside from value, people are interested in learning about your background and your experience in your craft. In your freelance profile, be open to including your qualifications, technical skills and number of years in the field. Prove to prospective clients that you’re qualified, confident and enthusiastic to take on their project. If you hit all of their checkpoints, they’ll add you to the shortlist—one step closer to the job!"},{"type":"h4","text":"Here, include:"},{"type":"list","text":"Your title \r\n| Years of experience in the field\r\n| Areas of expertise and\/or specialty\r\n| Technical skills and program knowledge\r\n| Industry expertise (if applicable)\r\n| Links to sample work"},{"type":"h2","text":"Step 4: Be Empathetic"},{"type":"content","text":"Empathy is hugely valuable as a business owner. Why? You need to be able to give your clients what they want, need and value. What’s more, it needs to come from a genuine place. Showing empathy directly on your freelance profile has the potential to place you leaps and bounds ahead of your competition. It shows you care and, better yet, it shows you’re human."},{"type":"content","text":"As you put together your profile, write for your target client—speak their language. Call out their pain points and address how you can help fix them. Remember, a little empathy from the start goes a long way."},{"type":"h2","text":"Step 5: Make It Simple for People to Contact You"},{"type":"content","text":"Don’t make people jump through hoops to contact you. So, make it simple for potential clients to find out where you’re based and how to start the conversation. Many clients choose to hire local talent, whether it’s for proximity reasons or to support the local community. By mentioning where you’re located—if you check all the qualification boxes—you could get the upper hand in local projects."},{"type":"content","text":"Further, the easier you are to contact, the more reliable you’ll appear. After all, reliability is one of the most important factors for clients when hiring freelancers. They’re essentially putting their vision in your capable hands. If you’re adding your freelance profile to a job network, their terms may require you to communicate within the platform. If that’s the case, don’t include external contact information to avoid getting penalized or banned from the site. These platforms were built to effectively handle communications."},{"type":"h2","text":"Step 6: Upload a Professional Photo"},{"type":"content","text":"With your next gig on the line, leave selfies out of it. A professional photo is a key piece in making positive first impressions. If you can, invest in taking professional headshots. If that isn’t feasible, simply find an appropriate setting and have a friend snap a few shots of you, with a quality camera. And remember, you don’t have to abide by the no-smile passport photo rule. You’re essentially trying to win over clients, so look inviting, warm and wear a clean shirt."},{"type":"h2","text":"Step 7: Create a Maintenance Plan"},{"type":"content","text":"Your freelance profile isn’t a get-it-and-forget-it asset. It actually requires regular maintenance. Just as you would update your resume as you gain more experience or earn another certificate, you also need to freshen up your online profile. So revisit your profile every few months to refresh the copy or add any new credentials."},{"type":"content","text":"For freelancers, your digital profile is your resume. If you want to get paid, you must have the freelance profile to back it up. It’s what makes a good first impression, gets you the interview and helps you stand out from the competition."},{"type":"content","text":"What can you add to your freelance profile to make it stronger? Do you have any other tips that you’d like to add to the list to help your fellow freelancers? We’d love to read your thoughts in the comments below."}],"title":"Build a great profile","id":"build-a","cat":"build-a-gr"}