{"content":[{"type":"h4","text":"There are usually three different strategies to use when determining how much you’re going to charge for your services. These include:"},{"type":"h2","text":"Cost Plus Pricing"},{"type":"content","text":"This is a popular, and relatively easy way in figuring out how much to charge. You simply determine the expenses involved in producing a product and then adding a little something extra to that amount so that you can turn a profit. This is especially useful for freelancers like photographers, videographers, and artists because they already know how much it costs for materials and development. So, they would take those costs and add their desired profit margin to come up with the rate.\r\nFor independent contractors like writers and freelance web designers, this may be a little more difficult to determine. The best way to settle on a rate is by knowing how much your monthly expenses are - rent, food, internet, insurance - and then add how much is needed for profit to pay your expenses."},{"type":"h2","text":"Market Rate Pricing"},{"type":"content","text":"This is another effective, and convenient way of figuring out your rates. By exploring how much other freelancers in your industry are charging for their services it gives you a rough estimate of what, and how, to charge clients. Perhaps you thought $20 per hour was fair for your web development skills, but realized that other professionals were charging for the entire project, which would come out to $25 per hour if broken down. You can visit freelance sites like Upwork or Elance to scoop out what competitors are charging."},{"type":"content","text":"Keep in mind though that location has a major impact on market rates. For example, a writer in the Philippines or India is going to charge less money that a writer in New York or San Francisco because the cost of living is more expensive in North America. While this can cause some problems, most clients do prefer working with clients in their part of the world, so be aware of the rates that relevant contractors in your area are charging."},{"type":"h2","text":"Value Driven Pricing"},{"type":"content","text":"If you’re a graphic designer would you expect to charge, and receive, the same rate from a Fortune 500 company and a local coffee shop? Absolutely not. And, that’s essentially what value driven pricing is. In other words, the client pays for what they believe the service is worth. However, you must also make sure that you live up to expectations."},{"type":"content","text":"When using this strategy, you can start off with a flat rate. Let’s say that you’re a graphic designer, and you charge $1,000 for a job. You can charge extra for the add-ons that the client requests because the local coffee shop may not need the extra add-ons that the Fortune 500 company does."},{"type":"h2","text":"Discovering Your Price Structure"},{"type":"content","text":"While the strategies listed above are a great place to start determining how much your services will cost a client, you still have to settle on a price structure to launch a successful freelance career."},{"type":"h2","text":"Hourly Rate"},{"type":"h4","text":"This is the most popular rate structure used by freelancers where you keep track of the hours it takes to complete a project for a client and bill them for those hours. To figure out how much to charge per hour, answer the following questions:"},{"type":"list","text":"How much do others charge? If the industry norm is $30 per hour, and you’re charging $100 per hour, then you may want to reconsider your rate.\r\n| What’s the maximum amount you can charge? This may take a bit of trial and error, but if your services are really worth $100 per hour, and you have clients willing to pay that rate, then that’s how much you should charge.\r\n| What do you need to survive? Figure out how many billable hours you can actually work per week and then calculate your costs - rent, groceries, internet, insurance, electricity, and any other essential bills. If you determine that you can work roughly 80 hours per month - that’s 20 hours per week - and you monthly bills come out to $2,000, then you at least have to charge $25 per hour."},{"type":"h4","text":"One of the biggest problems with hourly rates is that you are not going to be able to actually work 40 hours per week as a project freelancer since you have errands, accounting, and marketing your services on top of your work. So, don’t kid yourself into thinking that you’re going to make more money per month than you actually will."},{"type":"h4","text":"Another problem with hourly rates is that you have to keep track of time. Do you charge when you have an idea while driving? And, what’s the best way to track those billable hours?"},{"type":"h2","text":"Daily\/Weekly Rates"},{"type":"content","text":"Instead of an hourly rate, maybe you want to charge your client by the day or week. This can be effective for a couple of reasons. For starters, your services may only be needed for a just a couple of days or for a week. This means that you can plan accordingly and budget based on this rate - it’s also pretty easy to track. $25 times 10 hours is easier to track than just a flat rate of $500 for the week. Clients also like this rate because it pretty much guarantees that you’ll be focused solely on their work."},{"type":"h2","text":"Fixed Fate"},{"type":"content","text":"Another common rate structure is charging per project. For example, you’re a freelance marketer who charges $1,500 per month for client projects. Clients like this structure because they are well aware upfront of the cost of the project. And, it also makes your life easier since you don’t have to do too much budgeting and tracking."},{"type":"content","text":"When going this route, make sure that you know how much time and effort a project is going to take you to complete before sending out an estimate. The last thing you want is to spend more time on a project and not get paid a reasonable rate for the job because the job took five times longer than you had calculated it would take."},{"type":"content","text":"When starting out as a freelancer, it may be alright to undercharge a bit. Remember, clients want a deal, and you could use the work to build your portfolio and have your clients spread the word about how awesome you are. Once you get settled, however, you need to have a proper rate. Just keep in mind that you may want to still charge those original clients of yours a little less since they are the ones who helped launch your freelance career. Consider it a friends and family discount."}],"title":"How to Determine the Price of Your Services","id":"how-to-","cat":"how-to-det"}