{"content":[{"type":"h1","text":"Make Your CV"},{"type":"content","text":"Your CV is the first chance you get to make a good impression on a potential employer. A top-quality CV will considerably boost your chance of getting a face-to-face interview, so it is worth spending time and effort on the content and presentation. It will make all the difference in obtaining the position you want. You must therefore highlight your skills, expertise and value."},{"type":"content","text":"Make sure that you are concise and accurate. Your CV should not, generally, be longer than two pages, so make sure that you tailor it specifically to the job you are applying for and include the skills, qualifications and experience which are most suited to the job."},{"type":"h2","text":"An employer will want to find the following information in your CV:"},{"type":"list","text":"Personal details – Include your name and address, a phone number, and your email address. You may also add your nationality, gender and date of birth if you wish, but they are not obligatory.\r\n| Personal profile – This is optional, but it can be very effective in summarizing your areas of expertise and characteristics. It is good to include your enthusiasm about working as a Legal Secretary and what motivates you about the industry. Use keywords and keep it brief and concise.\r\n| Key Skills – Include any skills you have learned such as secretarial or IT skills. Explain what you think your personal skills are.\r\n| Employment history – Start with your current or last employer and work backwards. You should include the dates of employment, your job title, name of employer, nature of business, responsibilities, duties and achievements. Try not to leave gaps in your employment history; if you do, it is advisable to account for such times.\r\n| Education and qualifications – Write in chronological order a brief list of school, college and university qualifications, such as GCSEs, A-levels, etc., together with the grades you obtained. Then list any further qualifications you have obtained, together with the names of the awarding bodies. When you include the Legal Secretaries Diploma, make sure that you mention the units you covered and that you studied through The Institute of Legal Secretaries and PAs. If you are currently studying for a qualification, mention it together with any results achieved so far.\r\n| Interests – This is optional but gives you a chance to portray something about your personality. Keep it simple, mention what you do in your free time and note any achievements.\r\n| References – There is no need to write the details of your referees on your CV. Simply state that they are available on request, but make sure that you know who your referees are and that you have asked their permission to use them."}],"title":"Make Your CV","id":"make-yo","cat":"make-your-"}