{"content":[{"type":"h1","text":"Other ways to get your name out there would be to try some following strategies."},{"type":"list","text":"Create case studies that not only illustrate your skills and talents, but how you helped previous clients resolve a problem. If you have a portfolio on your site, this content is already up and running.|\r\n\r\nAsk past clients if they are willing to provide a testimonial that describes your work and place that testimonial on your website.|\r\n\r\nNetwork in-person at industry events, your local chamber of commerce, or by interacting with relevant groups and forums online. For example, you could answer questions on Quora or exchange ideas with a relevant LinkedIn group.|\r\n\r\nBecome a guest writer for a respected industry publications or blog in your field. Not only will you illustrate your knowledge, you’ll also get some valuable backlinks.|\r\n\r\nEducate others in your industry by teaching a workshop or course, speaking at an event, giving a presentation, judging a competition, or writing an e-book.|\r\n\r\nGet listed in local business directories and on both Google and Facebook ads.|\r\n\r\nPromote your brand through swag: t-shirts, pens, coffee mugs, or whatever cool stuff you may think your clients will enjoy.|\r\n\r\nOffer a free consultation, 30-day free trial, or product. Who doesn’t love free stuff?"},{"type":"h4","text":"Freelancers mostly also do a little cold e-mailing. It may be a little awkward at first, and it may not be the most effective, but it’s a necessary evil. Just search for the names of around 5-15 potential clients that you would want to work for, do a little digging, and find out how you can help them. Then reach out to them through an email. You may have to submit a contact form or message on Facebook if you can’t locate an email address."},{"type":"h4","text":"Remember, cold emails need to get right to the point. Introduce yourself, briefly explain why you’re contacting them, and provide a link that displays your work.\r\nWhile many of the above strategies can be effective, there’s nothing as effective as using your current network or seeking word-of-mouth referrals. Whether it’s a family member, friend, former co-worker, a college professor, or past client, word-of-mouth recommendations are priceless. You can earn this coveted recommendation by informing your current network of friends, family and business associates what you’re up to - hopefully they’ll spread the word for you - and by providing quality work on-time, there will be clients that will be glad to recommend you for work with others in the field you are working in."}],"title":"Try some strategies","id":"try-som","cat":"try-some-s"}