{"content":[{"type":"h1","text":"Final Words of Advice"},{"type":"content","text":"When you’re just starting out as a freelancer - whether it’s freelance writing, freelance graphic design, or anything in between, it’s really not that difficult to work more than 60 hours per week. Whether you’re just driven, excited, a workaholic, or worried about when you’ll see your next check, you can’t burn yourself out like this. We all need a break from time-to-time to clear our heads and recharge the batteries. And, that’s the beauty of being a freelancer. We can put in an insane amount of work in one week so that we can plan to take off a couple of days the following week."},{"type":"h2","text":"Here are a couple of other pieces of advice that every freelancer should consider taking to heart:"},{"type":"list","text":"You have to pay your own taxes - As mentioned earlier, freelancers are responsible for paying any federal, state, and local tax obligations. Don’t gripe about it. Just pay your taxes and be done.\r\n| Save your receipts - Paying for dinner when meeting a client is a tax deduction. Make sure you save those receipts.\r\n| Have emergency funds - That fat $5,000 payment is burning a hole in your pocket, but make-sure that you set aside some of that extra money. You never know when work will dry-up.\r\n| You’re not open 24\/7 - Even though you may work from home, it doesn’t mean that you’re available for work whenever a client requests your services. Furthermore, you need some much-needed time off as well. Try and have hours of operation that work best for you, like from 10 a.m. to 6 p.m. Monday through Friday.\r\n| It’s alright to outsource - Sometimes you can’t handle all the projects being thrown at you. When that happens it is acceptable to outsource some work to a fellow freelancer who is capable of delivering work that meets the standards of both you and your client. If you do outsource, make sure it’s someone that you trust and does quality work and make sure you go over the work carefully before handing it in.\r\n| Get comfortable - This doesn’t mean working from bed. It means creating a productive and comfortable work environment, like having a new computer or listening to your favorite music in your home so that you can work effectively and not get cabin fever.\r\n| Take care of yourself - When you’re working at home, it’s easy to neglect your health. Whether it’s remembering to eat a well-balanced meal or staying active, you have to make the effort to take care of your overall health.\r\n| You don’t have to accept every job - Sometimes we’re too busy to accept a new gig. Other times we may not like the project or even the client. And that’s alright. Just because you’re a freelancer doesn’t mean that you have to take every job opportunity."},{"type":"h2","text":"While there are pros and cons to being a freelancer, not everyone is cut out to be a freelancer. Some people need that structure in their lives. But if you’re self-motivated and tired of the 9-to-5 rat race, then freelancing is perfectly suited for you and can become a successful business venture and career."}],"title":"Final Words of Advice","id":"final-w","cat":"final-word"}