{"content":[{"type":"content","text":"We all know Freelancing is the future of Employment. Freelancing has become a very popular practice among our modern workforce. In the US itself 34% of the Professionals work as  Freelancers. If you are reading this that means either you are a freelancer or you want to be a freelancer, or maybe you want to hire a freelancer, but what I can vouch for is that you know about freelancing. Maybe you are familiar with the concept of freelancing, but where does the word “freelancer” really come from and what is the history behind it?  You may be surprised to know that freelancing came before the Internet. The earliest appearance of the word “freelance” occurred in Thomas N. Brown’s The Life and Times of Hugh Miller in 1809 and later mentioned by Sir Walter Scott in Ivanhoe (1820). Both describe a “free-lancer” as a medieval mercenary soldier who offered his services to the highest bidder. In medieval times, these soldiers were often called condottiere, lansquenet or stipendiaries. An example was Albrecht von Wallenstein who was a Protestant military leader hired by the Holy Roman Emperor Ferdinand II. He fought on the Catholic side against the Protestants during the Thirty Years’ War."},{"type":"content","text":"The term free-lancer comes from two different languages. Free has Germanic origins which means “to love” and lance is related to the old French word that means “to hurl, to throw, to discharge”. Several interpretations can be found on the Internet; some relate freelancer with the concept of freedom, others with the concept of happiness."},{"type":"content","text":"The word changed over time. Started as two words “free lance” in the early 1800s, then hyphenated “free-lance” in the 1920s and finally currently used integrated one “freelance” in the 1970s. It evolved from the military scene to the business scenario."},{"type":"content","text":"The word “freelance” can be used as a noun, a verb and an adjective. Nowadays, a freelancer is a person a self-employed worker or, as the Cambridge Dictionary defines it, a freelancer is “someone who works on different projects with different companies instead of being a company employee”. They can decide about the employer and time."},{"type":"content","text":"The American physicist and engineer Frank M. Nilles introduced the concept of working from home as a solution to transportation problems in the US, which made it very difficult for people living in remote areas to travel to the main towns for work in the 1970s."},{"type":"content","text":"As the Internet developed in the late 60s, these workers started connecting with each other for a particular job. Today, almost everyone has access to the Internet making it easier for freelancers and clients to connect. With the increase of freelance platforms, the competition is tougher than ever. Freelancers can explore the different platforms and clients can search for platforms that have the lowest fees."},{"type":"content","text":"A freelancer’s tools went from horses and weapons to laptops and smartphones that are full of data and have Internet access."}],"title":"The History of Freelancing","id":"the-his","cat":"the-histor"}