{"content":[{"type":"content","text":"A freelancer, or independent contractor, is a self-employed individual who doesn’t have to commit to a single, long-term employer. Instead, they work independently for several companies or clients. Freelancers typically charge by the hour or day and are not required to register as a business if they operate under their own name."},{"type":"content","text":"It’s often believed the term meaning a freelancer was used first in Sir Walter Scott’s classic Ivanhoe (1820), in which Scott stated, “I offered Richard the service of my Free Lances, and he refused them—I will lead them to Hull, seize on shipping, and embark for Flanders; thanks to the bustling times, a man of action will always find employment.” In other words, these persons were mercenary’s who offered their services to the highest bidder."},{"type":"content","text":"However, there was an earlier example of the term in 1809 by Thomas N. Brown’s, The Life and Times of Hugh Miller by stating, “But when the battle was hottest, Hugh Miller was a loyal combatant, not a free lance.”"},{"type":"content","text":"Today, the term is often associated with writers, photographers, editors, programmers, website designers, and professional consultants, as well as many other professional services."},{"type":"content","text":"According to Forbes, the best freelancing gigs are:"},{"type":"content","text":"Marketing - Project managers, Marketing coordinators, or Marketing managers can make between $46 to $52 an hour."},{"type":"content","text":"Business Project Management - Project Manager, Process Analyst are estimated to make $34 to $46 an hour."},{"type":"content","text":"Web Development - Creating, testing, or providing support for software or apps can result in earnings of $36 to $43 an hour."},{"type":"content","text":"Writing - Bloggers, copy editors, and content managers can make $25 to $30 an hour, which makes freelance writing a lucrative option for wordsmiths"},{"type":"content","text":"Accounting - It’s estimated that freelance accountants can earn between $16 to $30 an hour."},{"type":"content","text":"Insurance Inspection - Gathering information, such as photographs, and writing insurance reports can earn approximately $28 per hour."},{"type":"content","text":"Teaching\/Tutoring - Teaching online classes or being a tutor can bring in $20 to $28 an hour."},{"type":"content","text":"Social Media - Being a community manager or social media coordinators can result in $20 to $25 an hour."},{"type":"content","text":"Graphic Design - Website and application designers are able to make around $21+ per hour."},{"type":"content","text":"Administrative Assistant - Professional assistants can earn between $17 to $20 an hour."}],"title":"What is Freelancing?","id":"what-is","cat":"what-is-fr"}