{"content":[{"type":"h1","text":"Upwork"},{"type":"content","text":"The Upwork story begins over two decades ago when the tech lead of a Silicon Valley startup realized his close friend in Athens would be perfect for a web project. The team agreed he was the best choice, but were concerned about working with someone halfway around the globe."},{"type":"content","text":"Upwork, formerly Elance-oDesk, is an American freelancing platform where enterprises and individuals connect in order to conduct business. In 2015, the Elance-oDesk merger was rebranded as Upwork and the company's full name is now Upwork Global Inc. Upwork is currently based in Santa Clara and San Francisco, California, though it serves clients around the world."},{"type":"content","text":"Upwork has over eighteen million registered freelancers and five million registered clients. Three million jobs worth over $1Bn USD are posted annually, making Upwork the largest freelancer marketplace in the world."},{"type":"content","text":"The team agreed he was the best choice, but were concerned about working with someone halfway around the globe."},{"type":"h2","text":"History"},{"type":"content","text":"Elance was founded in 1998 by MIT graduate Beerud Sheth and Wall Street veteran Srini Anumolu in a two-bedroom apartment in Jersey City. In December of 1999, the company's 22 employees relocated to Sunnyvale, in the heart of California's Silicon Valley. Elance's first product was the Elance Small Business Marketplace.\r\noDesk was founded in 2003 by two friends, Odysseas Tsatalos and Stratis Karamanlakis,  who wanted to work together even though one of them was in the U.S. and the other was in Greece. Originally created as a staffing firm, oDesk was eventually built into an online marketplace that allowed registered users to find, hire, and collaborate with remote workers.\r\nElance and oDesk announced their merger on December 18, 2013 to create Elance-oDesk. In 2015, the new company was rebranded as Upwork, which coincided with an upgrade of the oDesk platform under the same name. The newly-named Upwork also planned to phase out the Elance platform within a couple of years. Though generally reliable, the Upwork platform has experienced brief outages. The most major to date occurred in September 2015, leading to an apology from then-CEO Stephane Kasriel."},{"type":"h2","text":"How Upwork Works"},{"type":"content","text":"Upwork allows clients to interview, hire and work with freelancers and freelance agencies through the company's platform. The client posts a description of their job and a price range they are willing to pay for a freelancer to complete it. The client may invite specific freelancers to apply for their jobs, or else post the job for any freelancer who is interested to apply. The client then &quot;interviews&quot; likely freelancers by reviewing their profiles and rankings, or even reaching out via chat to ask questions. Once the client has chosen who they want to complete the job, they hire that freelancer by sending a contract with set hours, pay rate, and a deadline for the work to be completed.\r\nClients must have an Upwork profile and be signed in to the platform in order to see all relevant freelancers. They can sort freelancers by ranking (how many good reviews they have), experience (the number of jobs successfully completed), or keywords (what kinds of work the freelancer can do).\r\nFreelancers can also see the ratings and job descriptions of clients who want to hire them.\r\nThe Upwork platform includes a searchable directory of freelancers, filters to help clients find relevant workers and freelancers to see relevant jobs, and a real-time chat feature that either clients or freelancers can use to message prospects. The chat feature is intended to reduce the time it takes to find, vet, and hire freelancers.\r\nUpwork offers options for both hourly and set-price contracts. The platform offers a time sheet application that allows freelancers to track their actual time spent working on projects with verified screenshots."},{"type":"h2","text":"Size, Scope, and Changes"},{"type":"content","text":"In March 2017, Upwork reported 14 million users in 180 countries with $1Bn USD in annual freelancer billings.\r\nHowever, the company purged 1.8 million freelancers in early 2020, probably as part of changes under the leadership of new CEO Hayden Brown. In a 2019 call with investors, Brown said that Upwork would be focusing more on serving the needs of Fortune 500 companies rather than smaller companies just looking for a quick job with a single gig worker. During this call, Brown also spoke of a &quot;skill gap&quot; between what companies were looking for on the Upwork platform and what they were getting. Many of the freelancers purged were rated as &quot;less skilled&quot; or had lower rankings on the platform.\r\nUpwork has also made other changes under Brown's leadership. The platform adopted paid client subscription rates, increased client payment fees from 2.75% to 3%, raised the cost of &quot;Connects&quot; (virtual tokens used by freelancers to submit job proposals), and changed the number of &quot;Connects&quot; needed for freelancers to submit job proposals. Brown has said that these changes were made to improve the quality of freelancers and freelance work available on the platform, but it also led to higher financial gains for Upwork and its investors."},{"type":"h2","text":"A better way of working remotely"},{"type":"content","text":"In response, the two friends created a new web-based platform that brought visibility and trust to remote work. It was so successful the two realized other businesses would also benefit from reliable access to a larger pool of proven talent, while workers would enjoy freedom and flexibility to find jobs online. Together they decided to start a company that would deliver on the promise of this technology. Fast-forward to today, that technology is the foundation of Upwork — the leading flexible talent solution. With millions of jobs posted on Upwork annually, independent professionals are earning money by providing companies with over 5,000 skills across more than 70 categories of work."},{"type":"h2","text":"A world of opportunities"},{"type":"content","text":"Through Upwork, businesses get more done, connecting with proven professionals to work on projects from web and mobile app development to SEO, social media marketing, content writing, graphic design, admin help and thousands of other projects. Upwork makes it fast, simple, and cost-effective to find, hire, work with, and pay the best professionals anywhere, any time."},{"type":"h2","text":"Upwork’s vision"},{"type":"content","text":"Independent talent at the heart of every business."},{"type":"h2","text":"Upwork's mission"},{"type":"content","text":"To create economic opportunities, so people have better lives."},{"type":"h2","text":"Upwork’s values"},{"type":"list","text":"Put our community first.\r\n|Inspire a boundless future of work.\r\n|Build amazing teams.\r\n|Have a bias towards action."}],"title":"Upwork","id":"upwork","cat":"upwork"}