{"content":[{"type":"h1","text":"Admin support"},{"type":"content","text":"Administrative assistant duties and responsibilities include providing administrative support to ensure efficient operation of the office. Supports managers and employees through a variety of tasks related to organization and communication. Responsible for confidential and time sensitive material. Familiar with a variety of the field's concepts, practices and procedures.\r\nAbility to effectively communicate via phone and email ensuring that all Administrative Assistant duties are completed accurately and delivered with high quality and in a timely manner. May direct and lead the work of others. Rely on experience and judgment to plan and accomplish goals and a wide degree of creativity and latitude is expected. Typically, reports to a manager or head of a unit\/department."},{"type":"h2","text":"Responsibilities:"},{"type":"list","text":"Answer and direct phone calls\r\n| Organize and schedule meetings and appointments\r\n| Maintain contact lists\r\n| Produce and distribute correspondence memos, letters, faxes and forms\r\n| Assist in the preparation of regularly scheduled reports\r\n| Develop and maintain a filing system\r\n| Order office supplies\r\n| Book travel arrangements\r\n| Submit and reconcile expense reports\r\n| Provide general support to visitors\r\n| Provide information by answering questions and requests\r\n| Take dictation\r\n| Research and creates presentations\r\n| Generate reports\r\n| Handle multiple projects\r\n| Prepare and monitor invoices\r\n| Develop administrative staff by providing information, educational opportunities and experiential growth opportunities\r\n\r\n\r\n| Ensure operation of equipment by completing preventive maintenance requirements; calling for repairs; maintaining equipment inventories; evaluating new equipment and techniques\r\n\r\n\r\n| Maintain supplies inventory by checking stock to determine inventory level; anticipating needed supplies; placing and expediting orders for supplies; verifying receipt of supplies\r\n\r\n\r\n| Maintain professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societies\r\n\r\n\r\n| Contribute to team effort by accomplishing related results as needed\r\n\r\n\r\n| Carry out administrative duties such as filing, typing, copying, binding, scanning etc.\r\n\r\n\r\n| Organize travel arrangements for senior managers\r\n| Write letters and emails on behalf of other office staff\r\n| Book conference calls, rooms, taxis, couriers, hotels etc.  \r\n| Cover the reception desk when required\r\n| Maintain computer and manual filing systems\r\n| Handle sensitive information in a confidential manner\r\n| Take accurate minutes of meetings\r\n| Coordinate office procedures\r\n| Reply to email, telephone or face to face inquiries\r\n| Develop and update administrative systems to make them more efficient\r\n| Resolve administrative problems\r\n| Receive, sort and distribute the mail\r\n| Answer telephone calls and pass them on\r\n| Manage staff appointments\r\n| Oversee and supervise the work of junior staff\r\n| Maintain up-to-date employee holiday records\r\n| Coordinate repairs to office equipment\r\n| Greet and assist visitors to the office\r\n| Photocopy and print out documents on behalf of other colleagues"},{"type":"h2","text":"Requirements:"},{"type":"list","text":"Proven admin or assistant experience\r\n| Knowledge of office management systems and procedures\r\n| Excellent time management skills and ability to multitask and prioritize work\r\n\r\n\r\n| Attention to detail and problem-solving skills\r\n| Excellent written and verbal communication skills\r\n| Strong organizational and planning skills\r\n| Proficient in MS Office\r\n| At least 7 years of experience in the field or in a related area\r\n| High school diploma or equivalent; college degree preferred"},{"type":"h2","text":"Administrative Assistant top skills &amp; proficiencies:"},{"type":"list","text":"Reporting Skills\r\n| Administrative Writing Skills\r\n| Microsoft Office Skills\r\n| Analysis\r\n| Professionalism\r\n| Problem-Solving\r\n| Supply Management\r\n| Inventory Control\r\n| Verbal Communication\r\n| Office Administration Procedures\r\n| Typing Skills\r\n| Attention to Detail\r\n| Accuracy\r\n| Multitask\r\n| Telephone Skills\r\n| Teamwork\r\n| Discretion and Judgment\r\n| Patience"}],"title":"Admin support","id":"admin-s","cat":"admin-supp"}