{"content":[{"type":"content","text":"Web development is the process of building websites and applications for the internet, or for a private network known as an intranet. Web development is not concerned with the design of a website; rather, it’s all about the coding and programming that powers the website’s functionality."},{"type":"content","text":"From the most simple, static web pages to social media platforms and apps, from e-commerce websites to content management systems (CMS); all the tools we use via the internet on a daily basis have been built by web developers."},{"type":"content","text":"Web development can be broken down into three layers: client-side coding (frontend), server-side coding (backend) and database technology."},{"type":"content","text":"Let’s take a look at each of these layers in more detail."},{"type":"h2","text":"Client-side"},{"type":"content","text":"Client-side scripting, or frontend development, refers to everything that the end user experiences directly. Client-side code executes in a web browser and directly relates to what people see when they visit a website. Things like layout, fonts, colors, menus and contact forms are all driven by the frontend."},{"type":"h2","text":"Server-side"},{"type":"content","text":"Server-side scripting, or backend development, is all about what goes on behind the scenes. The backend is essentially the part of a website that the user doesn’t actually see. It is responsible for storing and organizing data, and ensuring that everything on the client-side runs smoothly. It does this by communicating with the frontend. Whenever something happens on the client-side — say, a user fills out a form — the browser sends a request to the server-side. The server-side “responds” with relevant information in the form of frontend code that the browser can then interpret and display."},{"type":"h2","text":"Database technology"},{"type":"content","text":"Websites also rely on database technology. The database contains all the files and content that are necessary for a website to function, storing it in such a way that makes it easy to retrieve, organize, edit and save. The database runs on a server, and most websites typically use some form of relational database management system (RDBMS)."},{"type":"h4","text":"To summarize: the frontend, backend and database technology all work together to build and run a fully functional website or application, and these three layers form the foundation of web development."}],"title":"Back-End Development (Web Development)","id":"back-en","cat":"back-end-d"}